<?php

/**
 * 中国大陆地区使用
 * 时区: Asia/Shanghai
 * 中文简体(utf-8)
 */
return [

    // 时区名称,需php支持的时区名称
    'time_zone_name' => 'Asia/Shanghai',

    // 日历显示时第一列显示周几，(日历表第一列是周几,0周日,依次最大值6)
    // int
    'first_day_of_week' => 0,

    // 数字
    'number' => ['日', '一', '二', '三', '四', '五', '六', '七', '八', '九', '十'],

    // 星期
    'weekdays' => ['星期日', '星期一', '星期二', '星期三', '星期四', '星期五', '星期六'],
    'weekdays_short' => ['周日', '周一', '周二', '周三', '周四', '周五', '周六'],
    'weekdays_min' => ['日', '一', '二', '三', '四', '五', '六'],

    // 月
    'months' => ['一月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', '十二月'],
    'months_short' => ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月'],

    // 24节气名词
    'solar_terms' => ['春分', '清明', '谷雨', '立夏', '小满', '芒种', '夏至', '小暑', '大暑', '立秋', '处暑', '白露',
                      '秋分', '寒露', '霜降', '立冬', '小雪', '大雪', '冬至', '小寒', '大寒', '立春', '雨水', '惊蛰'],

    // 10天干
    'heavenly_stems' => ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'],

    // 12地支
    'earthly_branches' => ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'],

    // 星座
    'star_sign' => ['水瓶', '双鱼', '白羊', '金牛', '双子', '巨蟹', '狮子', '处女', '天秤', '天蝎', '射手', '摩羯'],

    // 生肖
    'symbolic_animals' => ['鼠', '牛', '虎', '兔', '龙', '蛇', '马', '羊', '猴', '鸡', '狗', '猪'],

    // 农历闰年表示
    'lunar_leap' => '(闰)',

    // 农历相关数字
    'lunar_number' => ['日', '一', '二', '三', '四', '五', '六', '七', '八', '九', '十'],

    // 农历整十表示
    'lunar_whole_tens' => ['初', '十', '廿', '卅'],

    // 农历月份表示
    'lunar_months' => ['正月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', '腊月'],

];
