<?php

/**
 * 中國香港地區使用
 * 時區: Asia/Hong_Kong
 * 中文繁體(utf-8)
 */
return [

    // 時區名稱,需php支持的時區名稱
    'time_zone_name' => 'Asia/Hong_Kong',

    // 日曆顯示時第一列顯示周幾，(日曆表第一列是周幾,0周日,依次最大值6)
    // int
    'first_day_of_week' => 0,

    // 數字
    'number' => ['日', '一', '二', '三', '四', '五', '六', '七', '八', '九', '十'],

    // 星期
    'weekdays' => ['星期日', '星期一', '星期二', '星期三', '星期四', '星期五', '星期六'],
    'weekdays_short' => ['周日', '周一', '周二', '周三', '周四', '周五', '周六'],
    'weekdays_min' => ['日', '一', '二', '三', '四', '五', '六'],

    // 月
    'months' => ['一月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', '十二月'],
    'months_short' => ['1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月'],

    // 24節氣名詞
    'solar_terms' => ['春分', '清明', '穀雨', '立夏', '小滿', '芒種', '夏至', '小暑', '大暑', '立秋', '處暑', '白露',
                      '秋分', '寒露', '霜降', '立冬', '小雪', '大雪', '冬至', '小寒', '大寒', '立春', '雨水', '驚蟄'],

    // 10天干
    'heavenly_stems' => ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'],

    // 12地支
    'earthly_branches' => ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'],

    // 星座
    'star_sign' => ['水瓶', '雙魚', '白羊', '金牛', '雙子', '巨蟹', '獅子', '處女', '天秤', '天蠍', '射手', '摩羯'],

    // 生肖
    'symbolic_animals' => ['鼠', '牛', '虎', '兔', '龍', '蛇', '馬', '羊', '猴', '雞', '狗', '豬'],

    // 農曆閏年表示
    'lunar_leap' => '(閏)',

    // 農曆相關數字
    'lunar_number' => ['日', '一', '二', '三', '四', '五', '六', '七', '八', '九', '十'],

    // 農曆整十表示
    'lunar_whole_tens' => ['初', '十', '廿', '卅'],

    // 農曆月份表示
    'lunar_months' => ['正月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', ' 臘月'],

];
